export const goodsArr = [
  {
    id: 1,
    title: 'Ролл угорь стандарт',
    info: 'Рис, угорь, соус унаги, кунжут, водоросли нори.',
    price: 250,
    img: 'image1.jpg',
  },
  {
    id: 2,
    title: 'Калифорния лосось стандарт',
    info: 'Рис, лосось, авокадо, огурец, майонез, икра масаго, водоросли нори.',
    price: 395,
    img: 'image2.jpg',
  },
  {
    id: 3,
    title: 'Окинава стандарт',
    info: 'Рис, креветка отварная, сыр сливочный, лосось, огурец свежий...',
    price: 250,
    img: 'image3.jpg',
  },
  {
    id: 4,
    title: 'Цезарь маки хl',
    info: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
    price: 250,
    img: 'image4.jpg',
  },
  {
    id: 5,
    title: 'Ясай маки стандарт 185 г',
    info: 'Рис, куриная грудка копченая, икра масаго, томат, айсберг, соус цезарь...',
    price: 250,
    img: 'image5.jpg',
  },
  {
    id: 6,
    title: 'Ролл с креветкой стандарт',
    info: 'Рис, водоросли нори, креветки отварные, сыр сливочный, огурцы',
    price: 250,
    img: 'image6.jpg',
  },
];
