<template>
  <footer class="footer">
    <div class="container">
      <div class="footer-box">
        <router-link class="logo header-logo" to="./">
          <img src="../assets/images/logo.png" alt="картинка логотип">
        </router-link>
        <div class="footer-nav">
          <ul>
            <li>Ресторанам</li>
            <li>Курьерам</li>
            <li>Пресс-центр</li>
            <li>Контакты</li>
          </ul>
        </div>
        <div class="footer-social">
          <!-- inst -->
          <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M17.1875 0H7.8125C3.49844 0 0 3.49844 0 7.8125V17.1875C0 21.5016 3.49844 25 7.8125 25H17.1875C21.5016 25 25 21.5016 25 17.1875V7.8125C25 3.49844 21.5016 0 17.1875 0ZM22.6562 17.1875C22.6562 20.2031 20.2031 22.6562 17.1875 22.6562H7.8125C4.79688 22.6562 2.34375 20.2031 2.34375 17.1875V7.8125C2.34375 4.79688 4.79688 2.34375 7.8125 2.34375H17.1875C20.2031 2.34375 22.6562 4.79688 22.6562 7.8125V17.1875Z"
              fill="url(#paint0_linear_243_55)" />
            <path
              d="M12.5 6.25C9.04844 6.25 6.25 9.04844 6.25 12.5C6.25 15.9516 9.04844 18.75 12.5 18.75C15.9516 18.75 18.75 15.9516 18.75 12.5C18.75 9.04844 15.9516 6.25 12.5 6.25ZM12.5 16.4062C10.3469 16.4062 8.59375 14.6531 8.59375 12.5C8.59375 10.3453 10.3469 8.59375 12.5 8.59375C14.6531 8.59375 16.4062 10.3453 16.4062 12.5C16.4062 14.6531 14.6531 16.4062 12.5 16.4062Z"
              fill="url(#paint1_linear_243_55)" />
            <path
              d="M19.2188 6.6141C19.6787 6.6141 20.0516 6.24124 20.0516 5.7813C20.0516 5.32135 19.6787 4.94849 19.2188 4.94849C18.7588 4.94849 18.386 5.32135 18.386 5.7813C18.386 6.24124 18.7588 6.6141 19.2188 6.6141Z"
              fill="url(#paint2_linear_243_55)" />
            <defs>
              <linearGradient id="paint0_linear_243_55" x1="2.28851" y1="22.7116" x2="22.7115" y2="2.28836"
                gradientUnits="userSpaceOnUse">
                <stop stop-color="#FFC107" />
                <stop offset="0.507" stop-color="#F44336" />
                <stop offset="0.99" stop-color="#9C27B0" />
              </linearGradient>
              <linearGradient id="paint1_linear_243_55" x1="8.0807" y1="16.9193" x2="16.9193" y2="8.0807"
                gradientUnits="userSpaceOnUse">
                <stop stop-color="#FFC107" />
                <stop offset="0.507" stop-color="#F44336" />
                <stop offset="0.99" stop-color="#9C27B0" />
              </linearGradient>
              <linearGradient id="paint2_linear_243_55" x1="18.63" y1="6.37028" x2="19.8076" y2="5.19246"
                gradientUnits="userSpaceOnUse">
                <stop stop-color="#FFC107" />
                <stop offset="0.507" stop-color="#F44336" />
                <stop offset="0.99" stop-color="#9C27B0" />
              </linearGradient>
            </defs>
          </svg>
          <!-- facebook -->
          <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M21.875 0H3.125C1.40156 0 0 1.40156 0 3.125V21.875C0 23.5984 1.40156 25 3.125 25H21.875C23.5984 25 25 23.5984 25 21.875V3.125C25 1.40156 23.5984 0 21.875 0Z"
              fill="#1976D2" />
            <path
              d="M21.0938 12.5H17.1875V9.375C17.1875 8.5125 17.8875 8.59375 18.75 8.59375H20.3125V4.6875H17.1875C14.5984 4.6875 12.5 6.78594 12.5 9.375V12.5H9.375V16.4062H12.5V25H17.1875V16.4062H19.5312L21.0938 12.5Z"
              fill="#FAFAFA" />
          </svg>
          <!-- vk -->
          <svg width="36" height="20" viewBox="0 0 36 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M17.1511 19.9157H19.2456C19.2456 19.9157 19.8788 19.8456 20.2009 19.4973C20.4988 19.1774 20.4879 18.5771 20.4879 18.5771C20.4879 18.5771 20.4462 15.7661 21.752 15.352C23.0381 14.9445 24.6901 18.0688 26.4406 19.2716C27.764 20.1808 28.7696 19.9815 28.7696 19.9815L33.4516 19.9157C33.4516 19.9157 35.9011 19.7646 34.7399 17.8387C34.6457 17.681 34.0629 16.4146 31.2585 13.8118C28.3226 11.0863 28.717 11.5289 32.2532 6.81617C34.4069 3.94605 35.2679 2.19331 34.9984 1.44401C34.7421 0.729766 33.158 0.918186 33.158 0.918186L27.891 0.948858C27.891 0.948858 27.501 0.896276 27.2097 1.06936C26.927 1.24025 26.7452 1.63462 26.7452 1.63462C26.7452 1.63462 25.9104 3.85622 24.7974 5.7448C22.451 9.73011 21.511 9.94044 21.1276 9.69286C20.2359 9.11665 20.4594 7.37486 20.4594 6.13917C20.4594 2.27656 21.0444 0.666228 19.3179 0.249952C18.7439 0.111923 18.3232 0.019904 16.8575 0.00456746C14.9777 -0.0151509 13.3849 0.0111402 12.4844 0.451517C11.8841 0.745102 11.4218 1.40019 11.7044 1.43744C12.0528 1.48345 12.8415 1.64996 13.26 2.2196C13.8012 2.95356 13.7814 4.60552 13.7814 4.60552C13.7814 4.60552 14.0926 9.1517 13.0562 9.71696C12.3442 10.1048 11.3692 9.31383 9.27689 5.6966C8.20552 3.84527 7.39488 1.79675 7.39488 1.79675C7.39488 1.79675 7.23932 1.41553 6.96107 1.21177C6.62367 0.964195 6.15043 0.885322 6.15043 0.885322L1.14196 0.915995C1.14196 0.915995 0.390475 0.937904 0.114417 1.26435C-0.130967 1.55575 0.0946991 2.15606 0.0946991 2.15606C0.0946991 2.15606 4.01646 11.3295 8.45529 15.9545C12.5282 20.194 17.1511 19.9157 17.1511 19.9157Z"
              fill="#1E88E5" />
          </svg>
        </div>
      </div>
    </div>
  </footer>
</template>

<script>
export default {

};
</script>

<style scoped>
.footer {
  display: flex;
  align-items: center;
  min-height: 156px;
  padding-block: 60px;
}

.footer-box {
  height: 100%;
  display: flex;
  flex-wrap: wrap;
  align-items: center;
  justify-content: space-between;
  gap: 36px;
}

.footer-logo {}

.footer-nav {
  flex-grow: 1;

  ul {
    display: flex;
    flex-wrap: wrap;
    align-items: center;
    list-style: none;
    gap: 15px;
    padding: 0;
    margin: 0;

    li {
      font-weight: 400;
      font-size: 18px;
      color: var(--gray---gray-8);
    }
  }
}

.footer-social {
  display: flex;
  align-items: center;
  justify-content: flex-end;
  gap: 21px;
}
</style>
